#------------------------------------------------------------
# 문자 자료형 => 문자열 string ---> str 타입
#------------------------------------------------------------
movieTitle='닥터스트레인지'
schoolName='대학'
msg="\"한글\"입니다"

# 모니터 화면에 출력하기 => print() 함수
print(movieTitle)
mmm="\"가나다라\n"
path='C:\\Users\\SIU\\Settings'
path2=r'C:\Program Files (x86)\LibreOffice\program\opengl'


#------------------------------------------------------------
# 문자열 타입(str) 연산하기
# 덧셈+, 곱셈*, 만 동작함
#------------------------------------------------------------
name='HONG'
addr="Daegu"

strAdd=name+addr+'\n'+'2022'+'dsa'
print("문자열 더하기", strAdd)


# 문자 + 숫자 => 불가합니다. ==> 자료형을 통일시키기
# 문자 + 문자, 숫자 + 숫자
# 자료형 변환 이라고 함 ( type casting )
print("ABC"+str(2020))
print(int("321")+2020)

#------------------------------------------------------------
# 문자열 곱셈 => 문자 * 숫자
#------------------------------------------------------------
print("ABC"*3)


